Repository: IvanLapegna/caropshibrida
Catalog: lib/l10n/app_*.arb
Languages: es

# iniciarSesion
source: Sign in
es: Iniciar sesión

# porFavorVerificaCorreo
source: Please verify your email before signing in.
es: Por favor, verifica tu correo antes de iniciar sesión.

# credencialesInvalidas
source: Invalid credentials
es: Credenciales inválidas

# usuarioDeshabilitado
source: User disabled
es: Usuario deshabilitado

# demasiadosIntentos
source: Too many attempts. Try again later.
es: Demasiados intentos. Probá más tarde.

# errorRed
source: Network error. Check your connection.
es: Error de red. Verificá tu conexión.

# errorInesperado
source: Unexpected error. Please try again.
es: Error inesperado

# debeIngresarCorreo
source: Email is required
es: Debe ingresar correo

# correoInvalido
source: Invalid email
es: Correo inválido

# debeIngresarContrasena
source: Password is required
es: Debe ingresar contraseña

# contrasenaLabel
source: Password
es: Contraseña

# entrar
source: Sign in
es: Entrar

# yaTenesCuentaIniciaSesion
source: Already have an account? Sign in
es: ¿Ya tenes una cuenta? Inicia sesión

# registrarse
source: Register
es: Registrarse

# registroExitosoTitle
source: Registration successful
es: Registro exitoso

# registroExitosoContent
source: We've sent a verification email. Please check it to be able to sign in.
es: Te enviamos un correo de verificación. Por favor, revísalo para poder iniciar sesión.

# aceptar
source: Accept
es: Aceptar

# confirmarContrasenaLabel
source: Confirm password
es: Confirmar contraseña

# crearCuenta
source: Create account
es: Crear cuenta

# yaExisteCuenta
source: An account with that email already exists.
es: Ya existe una cuenta con ese correo.

# emailInvalido
source: Invalid email.
es: Email inválido.

# contrasenaDebil
source: The password is too weak.
es: La contraseña es demasiado débil.

# noSePudoEnviarCorreoVerificacion
source: Could not send verification email. Try again later.
es: No se pudo enviar el correo de verificación. Inténtalo de nuevo más tarde.

# confirmacionObligatoria
source: Confirmation required
es: Confirmación obligatoria

# contrasenasNoCoinciden
source: Passwords do not match
es: Las contraseñas no coinciden

# editar
source: Edit
es: Editar

# eliminar
source: Delete
es: Eliminar

# eliminarGastoTitle
source: Delete Expense
es: Eliminar Gasto

# confirmDeleteExpense
source: Are you sure you want to delete the expense '{description}'?
es: ¿Seguro que quieres eliminar el gasto '{description}'?

# cancelar
source: Cancel
es: Cancelar

# gastoEliminado
source: Expense deleted
es: Gasto eliminado

# expense_edit_title
source: Edit Expense
es: Editar Gasto

# expense_add_title
source: Add Expense
es: Añadir Gasto

# expense_description_label
source: Description
es: Descripción

# expense_description_hint
source: E.g.: Fuel
es: Ej: Combustible

# expense_description_required
source: Expense description is required
es: La descripción del gasto es obligatoria

# expense_amount_label
source: Amount
es: Monto

# expense_amount_required
source: Expense amount is required
es: El monto del gasto es obligatorio

# expense_date_label
source: Expense date
es: Fecha del gasto

# expense_date_required
source: The date is required
es: La fecha de expiración es obligatoria

# expense_type_label
source: Expense type
es: Tipo de Gasto

# expense_type_required
source: Expense type is required
es: El tipo de gasto es obligatorio

# expense_save_changes
source: Save changes
es: Guardar cambios

# expense_add
source: Add expense
es: Añadir gasto

# error_not_logged
source: Error: You are not signed in.
es: Error: No has iniciado sesión.

# expense_saved_success
source: Expense saved successfully.
es: Gasto guardado con éxito.

# error_saving
source: Error saving: {error}
es: Error al guardar: {error}

# expense_added_success
source: Expense added successfully.
es: Gasto añadido con éxito.

# error_adding
source: Error adding: {error}
es: Error al añadir: {error}

# expense_list_title
source: My Expenses
es: Mis Gastos

# filter_by_date_title
source: Filter by Date
es: Filtrar por Fecha

# date_from_label
source: From:
es: Desde:

# date_to_label
source: To:
es: Hasta:

source: Select date
es: Seleccionar fecha

source: Cancel
es: Cancelar

source: Apply
es: Aplicar

# filter_by_type_title
source: Filter by Type
es: Filtrar por Tipo

source: View all
es: Ver todos

# filter_by_vehicle_title
source: Filter by Vehicle
es: Filtrar por Vehículo

# no_vehicles_registered
source: You don't have any registered vehicles
es: No tienes vehículos registrados

# fechas_label
source: Dates
es: Fechas

# date_start_short
source: Start
es: Inicio

# date_today_label
source: Today
es: Hoy

# date_range_from
source: From {start}
es: Desde {start}

# date_range_to
source: To {end}
es: Hasta {end}

# clear_filters_tooltip
source: Clear filters
es: Limpiar filtros

# vehicle_label_single
source: Vehicle
es: Vehículo

# vehicle_placeholder
source: Vehicle...
es: Vehículo...

# type_label
source: Type
es: Tipo

# no_expenses_message
source: You have no expenses. Go to 'My Vehicles' to add one from your car detail.
es: No tienes gastos. Ve a la sección 'Mis Vehículos' para añadir uno desde el detalle de tu auto.

# no_expenses_filtered
source: No expenses found with these filters.
es: No se encontraron gastos con estos filtros.

# home_title
source: My Vehicles
es: Mis Vehículos

# no_vehicles_home
source: You have no vehicles. Tap (+) to add one.
es: No tienes vehículos. Presiona (+) para añadir uno.

source: Loading...
es: Cargando...

# tooltip_expenses
source: Expenses
es: Gastos

# tooltip_add_vehicle
source: Add Vehicle
es: Añadir Vehículo

# tooltip_settings
source: Settings
es: Ajustes

# no_vehicles_centered
source: You have no vehicles. Tap (+) to add one.
es: No tienes vehículos. Presiona (+) para añadir uno.

# logout_confirmation_hint
source: Sign out
es: Cerrar sesión

# reminders_button_tooltip
source: Reminders
es: Recordatorios

# insurance_edit_title
source: Edit Insurance
es: Editar Seguro

# insurance_add_title
source: Add Insurance
es: Añadir Seguro

# insurance_name_label
source: Insurer
es: Aseguradora

# insurance_name_required
source: Insurer name is required
es: El nombre de la aseguradora es obligatorio

# policy_number_label
source: Policy No.
es: N° de póliza

# policy_number_required
source: Policy number is required
es: El N° de póliza es obligatorio

# expiration_date_label
source: Expiration date
es: Fecha de expiración

# expiration_date_required
source: Expiration date is required
es: La fecha de expiración es obligatoria

# coverage_label
source: Coverage type
es: Tipo de cobertura

# coverage_required
source: Coverage type is required
es: El tipo de cobertura es obligatorio

# engine_number_label
source: Engine No.
es: N° de motor

# engine_number_required
source: Engine number is required
es: El N° de motor es obligatorio

# chassis_number_label
source: Chassis No.
es: N° de chasis

# chassis_number_required
source: Chassis number is required
es: El N° de chasis es obligatorio

# policy_holder_label
source: Policy holder
es: Titular

# policy_holder_required
source: Policy holder name is required
es: El nombre del titular es obligatorio

# policy_document_title
source: Digital Policy Document
es: Comprobante de Póliza Digital

# pick_file_hint
source: Tap to upload Policy (PDF or Photo)
es: Tocar para subir Póliza (PDF o Foto)

# current_file_label
source: Current file:
es: Archivo actual:

# file_picker_edit_icon_semantic
source: Edit file
es: Editar archivo

source: Save changes
es: Guardar cambios

source: Add insurance
es: Añadir seguro

# insurance_saved_success
source: Insurance saved successfully.
es: Seguro guardado con éxito.

# insurance_added_success
source: Insurance added successfully.
es: Seguro añadido con éxito.

# map_title
source: Where did I park?
es: ¿Donde Estacione?

# no_car_id
source: No valid car id. Showing current location.
es: No hay id de auto válido. Mostrando ubicación actual.

# location_service_disabled
source: Location service is disabled.
es: El servicio de ubicación está desactivado.

source: Location permission denied.
es: Permiso de ubicación denegado.

# location_permission_denied_forever
source: Location permission denied permanently. Enable it from settings.
es: Permiso de ubicación denegado permanentemente. Habilitalo desde ajustes.

# error_getting_location
source: Error getting location: {error}
es: Error al obtener ubicación: {error}

# info_selected_location
source: Selected location
es: Ubicación seleccionada

# info_parked_here
source: Parked here
es: Estacionado aquí

# no_location_to_save
source: No location to save. Press Update first.
es: No hay ubicación para guardar. Presiona Actualizar primero.

# error_saving_firestore
source: Error saving to Firestore: {error}
es: Error al guardar en Firestore: {error}

# error_searching_car
source: Error searching car: {error}
es: Error buscando el auto: {error}

# marker_title_auto_parked
source: Car {id} (parked)
es: Auto {id} (parked)

# actualizar_button
source: Update
es: Actualizar

# guardar_button
source: Save
es: Guardar

# mostrar_ubicacion_tooltip
source: Show location
es: Mostrar ubicación

# exact_alarms_permission_title
source: Exact alarms permission
es: Permiso para alarmas exactas

# exact_alarms_permission_content
source: To trigger reminders at the exact time we need you to enable "Schedule exact alarms" in your phone settings. Do you want to open settings now?
es: Para que los recordatorios se desencadenen a la hora exacta necesitamos que actives "Programar alarmas exactas" en la configuración del teléfono. ¿Querés abrir la configuración ahora?

# open_button
source: Open
es: Abrir

# reminder_new_title
source: New reminder
es: Nuevo recordatorio

# reminder_edit_title
source: Edit reminder
es: Editar recordatorio

# reminder_field_title_label
source: Title
es: Título

source: Choose date
es: Elegir fecha

source: Choose time
es: Elegir hora

# time_must_be_future
source: The time must be in the future
es: La hora debe ser futura

# reminder_done_delete
source: Done / Delete
es: Realizado / Eliminar

# reminder_update
source: Update
es: Actualizar

# reminder_save
source: Save
es: Guardar

# reminder_deleted_success
source: Reminder deleted
es: Recordatorio eliminado

# reminder_updated_success
source: Reminder updated
es: Recordatorio actualizado

# reminder_created_success
source: Reminder created
es: Recordatorio creado

# appbar_reminders_title
source: My Reminders
es: Mis Recordatorios

# no_reminders_message
source: You have no reminders. Go to 'My Vehicles' to add one from your car detail.
es: No tienes recordatorios. Ve a la sección 'Mis Vehículos' para añadir uno desde el detalle de tu auto.

source: Vehicle not found
es: Vehículo no encontrado

# vehicle_deleted_message
source: Vehicle deleted. Returning to the list...
es: Vehículo eliminado. Volviendo a la lista...

source: Not available
es: No disponible

# delete_vehicle_button
source: Delete vehicle
es: Eliminar vehículo

# park_label
source: Park
es: Estacionar

# reminders_label
source: Reminders
es: Recordatorios

# section_vehicle_data
source: VEHICLE DATA
es: DATOS DEL VEHÍCULO

# edit_vehicle_tooltip
source: Edit vehicle data
es: Editar datos del vehículo

# last_update_label
source: Last Update
es: Última actualización: {date}

# license_plate_label
source: License
es: Patente

# brand_label
source: Brand
es: Marca

# model_label
source: Model
es: Modelo

# year_label
source: Year
es: Año

# engine_label
source: Engine
es: Motor

# transmission_label
source: Transmission
es: Transmisión

# insurance_section_title
source: INSURANCE
es: SEGURO

# view_policy_tooltip
source: View circulation card
es: Ver tarjeta circulación

source: No file uploaded.
es: No hay un archivo cargado.

# edit_insurance_tooltip
source: Edit insurance data
es: Editar datos seguro

# add_insurance_message
source: No insurance associated.
es: No hay un seguro asociado.

# add_insurance_button
source: Add Insurance
es: Agregar Seguro

# expenses_section_title
source: RECENT EXPENSES
es: GASTOS RECIENTES

# add_expense_tooltip
source: Add expense
es: Añadir gasto

# view_expenses_tooltip
source: View vehicle expenses
es: Ver gastos del vehículo

# no_expenses_registered
source: No expenses recorded
es: Ningún gasto registrado

# add_expense_button
source: Add Expense
es: Agregar Gasto

# generic_delete_success
source: Vehicle created successfully.
es: Vehículo creado con éxito.

# generic_delete_error
source: Error creating: {error}
es: Error al crear: {error}

# vehicle_edit_title
source: Edit Vehicle
es: Editar Vehículo

# vehicle_add_title
source: Add Vehicle
es: Añadir Vehículo

# brand_required
source: Please enter the brand
es: Por favor, ingresa la marca

# model_required
source: Please enter the model
es: Por favor, ingresa el modelo

# year_required
source: Please enter the year
es: Por favor, ingresa el año

# year_invalid
source: Enter a valid year
es: Ingresa un año válido

# license_plate_required
source: Please enter the license plate
es: Por favor, ingresa la patente

# engine_required
source: Please enter the engine
es: Por favor, ingresa el motor

# transmission_required
source: Please enter the transmission
es: Por favor, ingresa la transmisión

# gallery_option
source: Gallery / File explorer
es: Galería / Explorador de archivos

# camera_option
source: Camera
es: Cámara

source: No image selected.
es: Ninguna imagen seleccionada.

# image_load_error
source: Error loading
es: Error al cargar

# image_picker_gallery_title
source: Gallery / File explorer
es: Galería / Explorador de archivos

# image_picker_camera_title
source: Camera
es: Cámara

# camera_button_tooltip
source: Open image picker
es: Abrir selector de imagen

# save_changes_button
source: Save changes
es: Guardar cambios

# add_vehicle_button
source: Add vehicle
es: Añadir vehículo

# vehicle_saved_success
source: Vehicle saved successfully.
es: Vehículo guardado con éxito.

# vehicle_created_success
source: Vehicle created successfully.
es: Vehículo creado con éxito.

# error_creating
source: Error creating: {error}
es: Error al crear: {error}
